public/reading/economics/finance-theory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../reading.html">Reading</a> &gt; <a href="economics.html">Economics</a> &gt;
</p>

<div id="outline-container-org50b654f" class="outline-2">
<h2 id="org50b654f">15.401 - Finance Theory @ MIT</h2>
<div class="outline-text-2" id="text-org50b654f">
<p>
Here are my notes on Finance Theory I from professor Andrew Lo at
MIT. All the lessons can be watched <a href="https://www.youtube.com/watch?v=HdHlfiOAJyE">on youtube</a> for free.
</p>

<p>
I recently noticed that many people around me (digitally) were talking
about finance, however I do not have a framework for thinking of
finance because of my background. I am a programmer, a scientist, but
I was never introduced to the subject of economy. I never had a class
in economy in my education so I consider myself an humble beginner, I
started reading <a href="henry-hazltt-economics-in-one-lesson.html">Economics in one lesson</a> by Henry Hazltt which got me
interested to learn more, so I began watching these lessons on
youtube.
</p>
</div>

<div id="outline-container-orgbc77932" class="outline-3">
<h3 id="orgbc77932">Introduction</h3>
<div class="outline-text-3" id="text-orgbc77932">
<p>
The introductory lesson from Andrew Lo left me both speechless and
uncomfortable. The highlight of the lecture was an auction performed
in class, which went as follows. The teacher put two boxes on his
table and randomly selected one, just a tiny little box. He then asked
the students how much were they willing to pay for that box.  The
auction was real and he expected to be paid in cash, so students had
to say amounts that they would actually pay with their money. One
dollar, two, five, 15&#x2026; by the end the box was sold for 45$. The
teacher took a moment to reflect on the fact that nobody knew what
was in the box, or what his value was. Nobody could come closer to
inspect the object, yet they bet on its value. Well, now the value
of the box was 45$, they agreed on this price and so be it. What
the class just did is called price discovery, and it is something
that an economist has to do constantly.
</p>

<p>
On my logical mind I was like "they are just choosing a random number
and that its his value, what a bs, this is so stupid". And I though
about how do people value art pieces, or luxury items, or many other
things. This makes no sense yet the world works like this, I thought.
</p>

<p>
Moving on, the teacher writes about the six fundamental principles
of finance, namely:
</p>

<ul class="org-ul">
<li>There Is No Such Thing As A Free Lunch</li>
<li>Other Things Equal, Individuals
<ul class="org-ul">
<li>Prefer more money to less (non-satiation)</li>
<li>Prefer money now to later (impatience)</li>
<li>Prefer to avoid risk (risk aversion)</li>
</ul></li>
<li>All Agents Act To Further Their Own Self-Interest</li>
<li>Financial Market Prices Shift to Equalize Supply and Demand</li>
<li>Financial Markets Are Highly Adaptive and Competitive</li>
<li>Risk-Sharing and Frictions Are Central to Financial Innovation</li>
</ul>

<p>
The teacher explains to the class that all business activities reduce
to two functions: valuation of assets and management of assets. Yet,
once you are able to evaluate assets, managing becomes really easy.
Just to feel smarter, the economist threw an equation as if they
wanted to act like mathematicians.
</p>

<pre class="example">
Objecives + Valuations -&gt; Decision
</pre>

<p>
Another random equation is the definition of finance:
</p>

<pre class="example">
Mathematics + $$$ = Finance
</pre>

<p>
From this equation we also derive that:
</p>

<pre class="example">
Mathematics = Finance - $$$
</pre>

<hr />

<p>
Travel: <a href="economics.html">Economics</a>, <a href="../../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
